# Практика по property

class User:

    def __init__(self, login, password):
        self.login = login
        self.password = password


"""Проблема, которая возникает при работе с классом в том, что можно спокойно обращаться к аттрибутам этого
класса, менять аттрибуты и т.д.
В данном случае в password можно сохранить всё, что угодно. Даже создать объект класса, сохранить к этот пароль.
Но:
- пароль всегда должен быть строкой;
- нужно ззакрыть доступ к паролю;
- мы должны быть уверены, что пароль безопасный.
Для всего этого и нужно property. С его помощью можно отловить момент, когда"""

user1 = User("Ivan", 123)
