# Фильтрация данных без индексов. Общие механизмы фильтарции данных, которые заложены в pandas.
import pandas as pd

data = pd.read_csv("https://video.ittensive.com/python-advanced/internet-2017.csv",
                   na_values="NA", decimal=",", names=["Регион", "2017"], skiprows=1, index_col="Регион")
# Проверка подготовленных данных
print(data.head())
# Если написать data > 10, то будет проведено сравнение каждого значения в строке с числом 10 и,
# если условие выполняется, то выводится True или False
print(data > 10)
# В результате получается логическая серия данных
# Для красоты можно написать, что мы сравнивали серию "2017".
# Если серий данных несколько, то нужно указать какую серию мы сравнивали.
print(data["2017"] > 10)
# Получаем значения регионов, в которых доля проникновения интернета больше 10
data_more10 = data[data["2017"] > 10]
print(data_more10)
