# Модуль Simple Draw

import simple_draw as sd
# Если зажать Ctrl и мышкой на названии модуля, то откроется файл с содержанием этого модуля
# Находясь в этом файле можно в Pycharm нажать на структуру (левый нижний угол) и увидеть все переменные и функции,
# которые есть в этом модуле

sd.resolution = (1200, 600)
# нарисовать три вложенных окружности с шагом 5 пикселей
point = sd.get_point(300, 300)
radius = 50

for _ in range(3):
    radius += 5
    sd.circle(center_position=point, radius=radius, width=2)
#   Если стоять курсором внутри скобок и нажать Ctrl + P, то появится подсказка заполнения параметров для функции

# TODO написать функцию рисования пузырька, принимающую 2 параметра: точка рисования и шаг
def bubble(point, step):

# TODO нарисовать 10 пузырьков в ряд

# TODO нарисовать три ряда по 10 пузырьков

# TODO нарисовать 100 пузырьков в произвольных местах экрана случаными цветами

sd.pause()
