"""Создайте функцию, которая будет принимать две строки, a и b, и возвращать количество раз,
когда в обеих строках под одинаковыми индексами стоит одна и та же пара букв.
Эти буквы должны идти в одинаковой последовательности.

Например, если a = "bboiizz" и b = "bbuiiz", функция должна вернуть 3,
поскольку «bb», «ii», и «iz» встречаются в обеих строках на одинаковых позициях.
"""


def compare(a, b):
    zipa = zip(a, a[1:])
    zipb = zip(b, b[1:])
    res = (1 for ia, ib in zip(zipa, zipb) if ia == ib)
    return sum(res)


a = "bboiizz"
b = "bbuiiz"

print(compare(a, b))
